In [1]:
import numpy as np
import pandas as pd

In [2]:
labels = ['w','x','y','z']

In [3]:
list = [10,20,30,40]

In [4]:
array = np.array([10,20,30,40])

In [5]:
dict = {'w':10,'x':20,'y':30,'z':40}

In [6]:
pd.Series(data=list)

0    10
1    20
2    30
3    40
dtype: int64

In [7]:
pd.Series(data=list, index=labels)

w    10
x    20
y    30
z    40
dtype: int64

In [8]:
pd.Series(list,labels)

w    10
x    20
y    30
z    40
dtype: int64

In [9]:
pd.Series(array)

0    10
1    20
2    30
3    40
dtype: int32

In [10]:
pd.Series(array,labels)

w    10
x    20
y    30
z    40
dtype: int32

In [11]:
pd.Series(dict)

w    10
x    20
y    30
z    40
dtype: int64

In [12]:
sports1 = pd.Series([1,2,3,4],index = ['Cricket', 'Football','Basketball', 'Golf'])

In [13]:
sports1

Cricket       1
Football      2
Basketball    3
Golf          4
dtype: int64

In [14]:
sports1['Cricket']

1

In [15]:
sports1[0]

1

In [16]:
sports2 = pd.Series([1,2,5,4],index = ['Cricket', 'Football','Baseball', 'Golf'])

In [17]:
sports1 + sports2

Baseball      NaN
Basketball    NaN
Cricket       2.0
Football      4.0
Golf          8.0
dtype: float64

In [18]:
from numpy.random import randn

In [19]:
np.random.seed(1)

In [20]:
dataframe = pd.DataFrame(randn(10,5),index='A B C D E F G H I J'.split(),
                         columns='Score1 Score2 Score3 Score4 Score5'.split())

In [21]:
dataframe

     Score1    Score2    Score3    Score4    Score5
A  1.624345 -0.611756 -0.528172 -1.072969  0.865408
B -2.301539  1.744812 -0.761207  0.319039 -0.249370
C  1.462108 -2.060141 -0.322417 -0.384054  1.133769
D -1.099891 -0.172428 -0.877858  0.042214  0.582815
E -1.100619  1.144724  0.901591  0.502494  0.900856
F -0.683728 -0.122890 -0.935769 -0.267888  0.530355
G -0.691661 -0.396754 -0.687173 -0.845206 -0.671246
H -0.012665 -1.117310  0.234416  1.659802  0.742044
I -0.191836 -0.887629 -0.747158  1.692455  0.050808
J -0.636996  0.190915  2.100255  0.120159  0.617203

In [22]:
dataframe['Score3']

A   -0.528172
B   -0.761207
C   -0.322417
D   -0.877858
E    0.901591
F   -0.935769
G   -0.687173
H    0.234416
I   -0.747158
J    2.100255
Name: Score3, dtype: float64

In [23]:
dataframe[['Score2','Score1']]

     Score2    Score1
A -0.611756  1.624345
B  1.744812 -2.301539
C -2.060141  1.462108
D -0.172428 -1.099891
E  1.144724 -1.100619
F -0.122890 -0.683728
G -0.396754 -0.691661
H -1.117310 -0.012665
I -0.887629 -0.191836
J  0.190915 -0.636996

In [24]:
dataframe['Score6'] = dataframe['Score1'] + dataframe['Score2']

In [25]:
dataframe

     Score1    Score2    Score3    Score4    Score5    Score6
A  1.624345 -0.611756 -0.528172 -1.072969  0.865408  1.012589
B -2.301539  1.744812 -0.761207  0.319039 -0.249370 -0.556727
C  1.462108 -2.060141 -0.322417 -0.384054  1.133769 -0.598033
D -1.099891 -0.172428 -0.877858  0.042214  0.582815 -1.272319
E -1.100619  1.144724  0.901591  0.502494  0.900856  0.044105
F -0.683728 -0.122890 -0.935769 -0.267888  0.530355 -0.806618
G -0.691661 -0.396754 -0.687173 -0.845206 -0.671246 -1.088414
H -0.012665 -1.117310  0.234416  1.659802  0.742044 -1.129975
I -0.191836 -0.887629 -0.747158  1.692455  0.050808 -1.079465
J -0.636996  0.190915  2.100255  0.120159  0.617203 -0.446080

In [26]:
dataframe.drop('Score6',axis=1, inplace=True)

In [27]:
dataframe

     Score1    Score2    Score3    Score4    Score5
A  1.624345 -0.611756 -0.528172 -1.072969  0.865408
B -2.301539  1.744812 -0.761207  0.319039 -0.249370
C  1.462108 -2.060141 -0.322417 -0.384054  1.133769
D -1.099891 -0.172428 -0.877858  0.042214  0.582815
E -1.100619  1.144724  0.901591  0.502494  0.900856
F -0.683728 -0.122890 -0.935769 -0.267888  0.530355
G -0.691661 -0.396754 -0.687173 -0.845206 -0.671246
H -0.012665 -1.117310  0.234416  1.659802  0.742044
I -0.191836 -0.887629 -0.747158  1.692455  0.050808
J -0.636996  0.190915  2.100255  0.120159  0.617203

In [28]:
dataframe.drop('A',axis=0)

     Score1    Score2    Score3    Score4    Score5
B -2.301539  1.744812 -0.761207  0.319039 -0.249370
C  1.462108 -2.060141 -0.322417 -0.384054  1.133769
D -1.099891 -0.172428 -0.877858  0.042214  0.582815
E -1.100619  1.144724  0.901591  0.502494  0.900856
F -0.683728 -0.122890 -0.935769 -0.267888  0.530355
G -0.691661 -0.396754 -0.687173 -0.845206 -0.671246
H -0.012665 -1.117310  0.234416  1.659802  0.742044
I -0.191836 -0.887629 -0.747158  1.692455  0.050808
J -0.636996  0.190915  2.100255  0.120159  0.617203

In [29]:
dataframe.loc['F']

Score1   -0.683728
Score2   -0.122890
Score3   -0.935769
Score4   -0.267888
Score5    0.530355
Name: F, dtype: float64

In [30]:
dataframe.iloc[2]

Score1    1.462108
Score2   -2.060141
Score3   -0.322417
Score4   -0.384054
Score5    1.133769
Name: C, dtype: float64

In [31]:
dataframe.loc['A','Score1']

1.6243453636632417

In [32]:
dataframe.loc[['A','B'],['Score1','Score2']]

     Score1    Score2
A  1.624345 -0.611756
B -2.301539  1.744812

In [33]:
dataframe>0.5

   Score1  Score2  Score3  Score4  Score5
A    True   False   False   False    True
B   False    True   False   False   False
C    True   False   False   False    True
D   False   False   False   False    True
E   False    True    True    True    True
F   False   False   False   False    True
G   False   False   False   False   False
H   False   False   False    True    True
I   False   False   False    True   False
J   False   False    True   False    True

In [34]:
dataframe[dataframe>0.5]

     Score1    Score2    Score3    Score4    Score5
A  1.624345       NaN       NaN       NaN  0.865408
B       NaN  1.744812       NaN       NaN       NaN
C  1.462108       NaN       NaN       NaN  1.133769
D       NaN       NaN       NaN       NaN  0.582815
E       NaN  1.144724  0.901591  0.502494  0.900856
F       NaN       NaN       NaN       NaN  0.530355
G       NaN       NaN       NaN       NaN       NaN
H       NaN       NaN       NaN  1.659802  0.742044
I       NaN       NaN       NaN  1.692455       NaN
J       NaN       NaN  2.100255       NaN  0.617203

In [35]:
dataframe[dataframe['Score1']>0.5]

     Score1    Score2    Score3    Score4    Score5
A  1.624345 -0.611756 -0.528172 -1.072969  0.865408
C  1.462108 -2.060141 -0.322417 -0.384054  1.133769

In [36]:
dataframe[dataframe['Score1']>0.5]['Score2']

A   -0.611756
C   -2.060141
Name: Score2, dtype: float64

In [37]:
dataframe[dataframe['Score1']>0.5][['Score2','Score3']]

     Score2    Score3
A -0.611756 -0.528172
C -2.060141 -0.322417

In [38]:
dataframe[(dataframe['Score1']>0.5) & (dataframe['Score2'] > 0)]

Empty DataFrame
Columns: [Score1, Score2, Score3, Score4, Score5]
Index: []

     Score1    Score2    Score3    Score4    Score5
A  1.624345 -0.611756 -0.528172 -1.072969  0.865408
B -2.301539  1.744812 -0.761207  0.319039 -0.249370
C  1.462108 -2.060141 -0.322417 -0.384054  1.133769
D -1.099891 -0.172428 -0.877858  0.042214  0.582815
E -1.100619  1.144724  0.901591  0.502494  0.900856
F -0.683728 -0.122890 -0.935769 -0.267888  0.530355
G -0.691661 -0.396754 -0.687173 -0.845206 -0.671246
H -0.012665 -1.117310  0.234416  1.659802  0.742044
I -0.191836 -0.887629 -0.747158  1.692455  0.050808
J -0.636996  0.190915  2.100255  0.120159  0.617203

In [40]:
dataframe

     Score1    Score2    Score3    Score4    Score5
A  1.624345 -0.611756 -0.528172 -1.072969  0.865408
B -2.301539  1.744812 -0.761207  0.319039 -0.249370
C  1.462108 -2.060141 -0.322417 -0.384054  1.133769
D -1.099891 -0.172428 -0.877858  0.042214  0.582815
E -1.100619  1.144724  0.901591  0.502494  0.900856
F -0.683728 -0.122890 -0.935769 -0.267888  0.530355
G -0.691661 -0.396754 -0.687173 -0.845206 -0.671246
H -0.012665 -1.117310  0.234416  1.659802  0.742044
I -0.191836 -0.887629 -0.747158  1.692455  0.050808
J -0.636996  0.190915  2.100255  0.120159  0.617203

In [41]:
dataframe.reset_index()

  index    Score1    Score2    Score3    Score4    Score5
0     A  1.624345 -0.611756 -0.528172 -1.072969  0.865408
1     B -2.301539  1.744812 -0.761207  0.319039 -0.249370
2     C  1.462108 -2.060141 -0.322417 -0.384054  1.133769
3     D -1.099891 -0.172428 -0.877858  0.042214  0.582815
4     E -1.100619  1.144724  0.901591  0.502494  0.900856
5     F -0.683728 -0.122890 -0.935769 -0.267888  0.530355
6     G -0.691661 -0.396754 -0.687173 -0.845206 -0.671246
7     H -0.012665 -1.117310  0.234416  1.659802  0.742044
8     I -0.191836 -0.887629 -0.747158  1.692455  0.050808
9     J -0.636996  0.190915  2.100255  0.120159  0.617203

In [42]:
newindex = 'IND JP CAN GE IT PL FY IU RT IP'.split()

In [43]:
dataframe['Countries'] = newindex

In [44]:
dataframe

     Score1    Score2    Score3    Score4    Score5 Countries
A  1.624345 -0.611756 -0.528172 -1.072969  0.865408       IND
B -2.301539  1.744812 -0.761207  0.319039 -0.249370        JP
C  1.462108 -2.060141 -0.322417 -0.384054  1.133769       CAN
D -1.099891 -0.172428 -0.877858  0.042214  0.582815        GE
E -1.100619  1.144724  0.901591  0.502494  0.900856        IT
F -0.683728 -0.122890 -0.935769 -0.267888  0.530355        PL
G -0.691661 -0.396754 -0.687173 -0.845206 -0.671246        FY
H -0.012665 -1.117310  0.234416  1.659802  0.742044        IU
I -0.191836 -0.887629 -0.747158  1.692455  0.050808        RT
J -0.636996  0.190915  2.100255  0.120159  0.617203        IP

In [46]:
dataframe.set_index('Countries' , inplace=True)

In [47]:
dataframe

             Score1    Score2    Score3    Score4    Score5
Countries
IND        1.624345 -0.611756 -0.528172 -1.072969  0.865408
JP        -2.301539  1.744812 -0.761207  0.319039 -0.249370
CAN        1.462108 -2.060141 -0.322417 -0.384054  1.133769
GE        -1.099891 -0.172428 -0.877858  0.042214  0.582815
IT        -1.100619  1.144724  0.901591  0.502494  0.900856
PL        -0.683728 -0.122890 -0.935769 -0.267888  0.530355
FY        -0.691661 -0.396754 -0.687173 -0.845206 -0.671246
IU        -0.012665 -1.117310  0.234416  1.659802  0.742044
RT        -0.191836 -0.887629 -0.747158  1.692455  0.050808
IP        -0.636996  0.190915  2.100255  0.120159  0.617203

In [48]:
dataframe = pd.DataFrame({'Cricket':[1,2,np.nan,4,6,7,2,np.nan],
                  'Baseball':[5,np.nan,np.nan,5,7,2,4,5],
                  'Tennis':[1,2,3,4,5,6,7,8]})

In [49]:
dataframe

   Baseball  Cricket  Tennis
0       5.0      1.0       1
1       NaN      2.0       2
2       NaN      NaN       3
3       5.0      4.0       4
4       7.0      6.0       5
5       2.0      7.0       6
6       4.0      2.0       7
7       5.0      NaN       8

In [50]:
dataframe.dropna()

   Baseball  Cricket  Tennis
0       5.0      1.0       1
3       5.0      4.0       4
4       7.0      6.0       5
5       2.0      7.0       6
6       4.0      2.0       7

In [51]:
dataframe.dropna(axis=1)

   Tennis
0       1
1       2
2       3
3       4
4       5
5       6
6       7
7       8

In [54]:
dataframe.dropna(thresh=1)

   Baseball  Cricket  Tennis
0       5.0      1.0       1
1       NaN      2.0       2
2       NaN      NaN       3
3       5.0      4.0       4
4       7.0      6.0       5
5       2.0      7.0       6
6       4.0      2.0       7
7       5.0      NaN       8

In [55]:
dataframe.fillna(value=0)

   Baseball  Cricket  Tennis
0       5.0      1.0       1
1       0.0      2.0       2
2       0.0      0.0       3
3       5.0      4.0       4
4       7.0      6.0       5
5       2.0      7.0       6
6       4.0      2.0       7
7       5.0      0.0       8

In [58]:
dataframe['Baseball'].fillna(value=4.6667)

0    5.0000
1    4.6667
2    4.6667
3    5.0000
4    7.0000
5    2.0000
6    4.0000
7    5.0000
Name: Baseball, dtype: float64

In [57]:
dataframe['Baseball'].mean()

4.666666666666667

In [59]:
dat = {'CustID':['1001','1001','1002','1002','1003','1003'],
       'CustName':['UIPat','DatRob','Goog','Chrysler','Ford','GM'],
       'Profitinlakhs':[2005,3245,1245,8765,5463,3547]}

In [60]:
dat

{'CustID': ['1001', '1001', '1002', '1002', '1003', '1003'],
 'CustName': ['UIPat', 'DatRob', 'Goog', 'Chrysler', 'Ford', 'GM'],
 'Profitinlakhs': [2005, 3245, 1245, 8765, 5463, 3547]}

In [61]:
dataframe = pd.DataFrame(dat)

In [62]:
dataframe

  CustID  CustName  Profitinlakhs
0   1001     UIPat           2005
1   1001    DatRob           3245
2   1002      Goog           1245
3   1002  Chrysler           8765
4   1003      Ford           5463
5   1003        GM           3547

In [64]:
grouped_CustID = dataframe.groupby('CustID')

In [65]:
grouped_CustID.mean()

        Profitinlakhs
CustID
1001             2625
1002             5005
1003             4505

In [76]:
grouped_CustID.describe().transpose()['1002']

Profitinlakhs  count       2.000000
               mean     5005.000000
               std      5317.442995
               min      1245.000000
               25%      3125.000000
               50%      5005.000000
               75%      6885.000000
               max      8765.000000
Name: 1002, dtype: float64

In [89]:
dafa1 = pd.DataFrame({'CustID': ['101', '102', '103', '104'],
                        'Sales': [13456, 45321, 54385, 53212],
                        'Priority': ['CAT0', 'CAT1', 'CAT2', 'CAT3'],
                        'Prime': ['yes', 'no', 'no', 'yes']},
                        index=['in1', 'in2', 'in3', 'in4'])

dafa2 = pd.DataFrame({'CustID': ['101', '103', '104', '105'],
                        'Sales': [13456, 54385, 53212, 4534],
                        'Payback': ['CAT4', 'CAT5', 'CAT6', 'CAT7'],
                        'Imp': ['yes', 'no', 'no', 'no']},
                         index=['in1', 'in3', 'in4', 'in5'])

In [81]:
pd.concat([dafa1,dafa2],axis=1)

  CustID Prime Priority    Sales CustID  Imp Payback    Sales
0    101   yes     CAT0  13456.0    NaN  NaN     NaN      NaN
1    102    no     CAT1  45321.0    NaN  NaN     NaN      NaN
2    103    no     CAT2  54385.0    NaN  NaN     NaN      NaN
3    104   yes     CAT3  53212.0    NaN  NaN     NaN      NaN
4    NaN   NaN      NaN      NaN    101  yes    CAT4  13456.0
5    NaN   NaN      NaN      NaN    103   no    CAT5  54385.0
6    NaN   NaN      NaN      NaN    104   no    CAT6  53212.0
7    NaN   NaN      NaN      NaN    105   no    CAT7   4534.0

In [87]:
pd.merge(dafa1,dafa2,how='left',on='CustID')

  CustID Prime Priority  Sales_x  Imp Payback  Sales_y
0    101   yes     CAT0    13456  yes    CAT4  13456.0
1    102    no     CAT1    45321  NaN     NaN      NaN
2    103    no     CAT2    54385   no    CAT5  54385.0
3    104   yes     CAT3    53212   no    CAT6  53212.0

In [90]:
dafa1

    CustID Prime Priority  Sales
in1    101   yes     CAT0  13456
in2    102    no     CAT1  45321
in3    103    no     CAT2  54385
in4    104   yes     CAT3  53212

In [91]:
dafa2

    CustID  Imp Payback  Sales
in1    101  yes    CAT4  13456
in3    103   no    CAT5  54385
in4    104   no    CAT6  53212
in5    105   no    CAT7   4534

In [93]:
dafa3 = pd.DataFrame({'Q1': ['101', '102', '103'],
                     'Q2': ['201', '202', '203']},
                      index=['I0', 'I1', 'I2']) 

dafa4 = pd.DataFrame({'Q3': ['301', '302', '303'],
                    'Q4': ['401', '402', '403']},
                      index=['I0', 'I2', 'I3'])

In [98]:
dafa3.join(dafa4, how='right')

     Q1   Q2   Q3   Q4
I0  101  201  301  401
I2  103  203  302  402
I3  NaN  NaN  303  403

In [134]:
dataframe = pd.DataFrame({'custID':[1,2,3,4],
                          'SaleType':['big',np.nan,'medium',np.nan],
                          'SalesCode':[np.nan,'131','141','151']})

In [100]:
dataframe

  SaleType SalesCode  custID
0      big       121       1
1    small       131       2
2   medium       141       3
3      big       151       4

In [103]:
dataframe.head()

  SaleType SalesCode  custID
0      big       121       1
1    small       131       2
2   medium       141       3
3      big       151       4

In [107]:
dataframe['SaleType'].value_counts()

big       2
medium    1
small     1
Name: SaleType, dtype: int64

In [110]:
newdataframe = dataframe[(dataframe['custID']!=3) & (dataframe['SaleType']=='big')]

In [111]:
newdataframe

  SaleType SalesCode  custID
0      big       121       1
3      big       151       4

In [115]:
def profit(a):
    return a*4

In [116]:
dataframe['custID'].apply(profit)

0     4
1     8
2    12
3    16
Name: custID, dtype: int64

In [117]:
dataframe['SaleType'].apply(len)

0    3
1    5
2    6
3    3
Name: SaleType, dtype: int64

In [118]:
dataframe['custID'].sum()

10

In [119]:
del dataframe['custID']

In [120]:
dataframe

  SaleType SalesCode
0      big       121
1    small       131
2   medium       141
3      big       151

In [122]:
dataframe.index

RangeIndex(start=0, stop=4, step=1)

In [125]:
dataframe

  SaleType SalesCode  custID
0      big       121       1
1    small       131       2
2   medium       141       3
3      big       151       4

In [129]:
dataframe.sort_values(by='SaleType')

  SaleType SalesCode  custID
0      big       121       1
3      big       151       4
2   medium       141       3
1    small       131       2

In [130]:
dataframe.isnull()

   SaleType  SalesCode  custID
0     False      False   False
1     False      False   False
2     False      False   False
3     False      False   False

In [136]:
dataframe.dropna()

  SaleType SalesCode  custID
2   medium       141       3

In [135]:
dataframe

  SaleType SalesCode  custID
0      big       NaN       1
1      NaN       131       2
2   medium       141       3
3      NaN       151       4

In [137]:
dataframe.fillna('Not nan')

  SaleType SalesCode  custID
0      big   Not nan       1
1  Not nan       131       2
2   medium       141       3
3  Not nan       151       4

In [138]:
dataframe = pd.read_csv('pandas-train.csv')

In [139]:
dataframe

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
12,13,0,3,"Saundercock, Mr. William Henry",male,20.0,0,0,A/5. 2151,8.0500,NaN,S
13,14,0,3,"Andersson, Mr. Anders Johan",male,39.0,1,5,347082,31.2750,NaN,S
14,15,0,3,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.0,0,0,350406,7.8542,NaN,S
15,16,1,2,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,0,0,248706,16.0000,NaN,S
16,17,0,3,"Rice, Master. Eugene",male,2.0,4,1,382652,29.1250,NaN,Q
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,NaN,S
18,19,0,3,"Vander Planke, Mrs. Julius (Emelia Maria Vande...",female,31.0,1,0,345763,18.0000,NaN,S
19,20,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,NaN,C
20,21,0,2,"Fynney, Mr. Joseph J",male,35.0,0,0,239865,26.0000,NaN,S
21,22,1,2,"Beesley, Mr. Lawrence",male,34.0,0,0,248698,13.0000,D56,S
22,23,1,3,"McGowan, Miss. Anna ""Annie""",female,15.0,0,0,330923,8.0292,NaN,Q
23,24,1,1,"Sloper, Mr. William Thompson",male,28.0,0,0,113788,35.5000,A6,S
24,25,0,3,"Palsson, Miss. Torborg Danira",female,8.0,3,1,349909,21.0750,NaN,S
25,26,1,3,"Asplund, Mrs. Carl Oscar (Selma Augusta Emilia...",female,38.0,1,5,347077,31.3875,NaN,S
26,27,0,3,"Emir, Mr. Farred Chehab",male,NaN,0,0,2631,7.2250,NaN,C
27,28,0,1,"Fortune, Mr. Charles Alexander",male,19.0,3,2,19950,263.0000,C23 C25 C27,S
28,29,1,3,"O'Dwyer, Miss. Ellen ""Nellie""",female,NaN,0,0,330959,7.8792,NaN,Q
29,30,0,3,"Todoroff, Mr. Lalio",male,NaN,0,0,349216,7.8958,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
861,862,0,2,"Giles, Mr. Frederick Edward",male,21.0,1,0,28134,11.5000,NaN,S
862,863,1,1,"Swift, Mrs. Frederick Joel (Margaret Welles Ba...",female,48.0,0,0,17466,25.9292,D17,S
863,864,0,3,"Sage, Miss. Dorothy Edith ""Dolly""",female,NaN,8,2,CA. 2343,69.5500,NaN,S
864,865,0,2,"Gill, Mr. John William",male,24.0,0,0,233866,13.0000,NaN,S
865,866,1,2,"Bystrom, Mrs. (Karolina)",female,42.0,0,0,236852,13.0000,NaN,S
866,867,1,2,"Duran y More, Miss. Asuncion",female,27.0,1,0,SC/PARIS 2149,13.8583,NaN,C
867,868,0,1,"Roebling, Mr. Washington Augustus II",male,31.0,0,0,PC 17590,50.4958,A24,S
868,869,0,3,"van Melkebeke, Mr. Philemon",male,NaN,0,0,345777,9.5000,NaN,S
869,870,1,3,"Johnson, Master. Harold Theodor",male,4.0,1,1,347742,11.1333,NaN,S
870,871,0,3,"Balkic, Mr. Cerin",male,26.0,0,0,349248,7.8958,NaN,S
871,872,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,1,1,11751,52.5542,D35,S
872,873,0,1,"Carlsson, Mr. Frans Olof",male,33.0,0,0,695,5.0000,B51 B53 B55,S
873,874,0,3,"Vander Cruyssen, Mr. Victor",male,47.0,0,0,345765,9.0000,NaN,S
874,875,1,2,"Abelson, Mrs. Samuel (Hannah Wizosky)",female,28.0,1,0,P/PP 3381,24.0000,NaN,C
875,876,1,3,"Najib, Miss. Adele Kiamie ""Jane""",female,15.0,0,0,2667,7.2250,NaN,C
876,877,0,3,"Gustafsson, Mr. Alfred Ossian",male,20.0,0,0,7534,9.8458,NaN,S
877,878,0,3,"Petroff, Mr. Nedelio",male,19.0,0,0,349212,7.8958,NaN,S
878,879,0,3,"Laleff, Mr. Kristo",male,NaN,0,0,349217,7.8958,NaN,S
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
880,881,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,0,1,230433,26.0000,NaN,S
881,882,0,3,"Markun, Mr. Johann",male,33.0,0,0,349257,7.8958,NaN,S
882,883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S
883,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [140]:
dataframe.to_csv('titanic.csv',index=False)

In [143]:
dataframe = pd.read_excel('pandas-Consumer.xlsx',sheet_name='Data1')

In [144]:
dataframe

    Income  HouseholdSize  AmountCharged
0       54              3           4016
1       30              2           3159
2       32              4           5100
3       50              5           4742
4       31              2           1864
5       55              2           4070
6       37              1           2731
7       40              2           3348
8       66              4           4764
9       51              3           4110
10      25              3           4208
11      48              4           4219
12      27              1           2477
13      33              2           2514
14      65              3           4214
15      63              4           4965
16      42              6           4412
17      21              2           2448
18      44              1           2995
19      37              5           4171
20      62              6           5678
21      21              3           3623
22      55              7           5301
23      42              2           3020
24      41              7           4828
25      54              6           5573
26      30              1           2583
27      48              2           3866
28      34              5           3586
29      67              4           5037
30      50              2           3605
31      67              5           5345
32      55              6           5370
33      52              2           3890
34      62              3           4705
35      64              2           4157
36      22              3           3579
37      29              4           3890
38      39              2           2972
39      35              1           3121
40      39              4           4183
41      54              3           3730
42      23              6           4127
43      27              2           2921
44      26              7           4603
45      61              2           4273
46      30              2           3067
47      22              4           3074
48      46              5           4820
49      66              4           5149

In [145]:
dataframe.to_excel('Consumer2.xlsx',sheet_name='Sheet1')